// T - тип элемента набора вариантов, V - выходное значение, S - отображаемое значение

// T - string, V - string, S - string
const DATA_SET_1 = [
	"Россия",
	"Белоруссия",
	"Казахстан",
	"Польша"
];

// T - object, V - number (id), S - string (name)
const DATA_SET_2 = [
	{
		"id": 203,
		"name": "Андрей Стаселько"
	},
	{
		"id": 200,
		"name": "Валентина Гелясина"
	},
	{
		"id": 185,
		"name": "Виктория Апетёнок"
	},
	{
		"id": 192,
		"name": "Владислав Романов"
	},
	{
		"id": 196,
		"name": "Елена Рыштакова"
	},
	{
		"id": 347,
		"name": "Захар Журавлёв"
	},
	{
		"id": 186,
		"name": "Ирина Толкачёва"
	},
	{
		"id": 296,
		"name": "Наталья Нестерович"
	},
	{
		"id": 188,
		"name": "Парфенова Раиса"
	},
	{
		"id": 184,
		"name": "Татьяна Сарокина"
	},
	{
		"id": 215,
		"name": "Андрей Степин"
	},
	{
		"id": 216,
		"name": "Анна Сулима"
	},
	{
		"id": 213,
		"name": "Артём Карпук"
	},
	{
		"id": 261,
		"name": "Валерий Матусевич"
	},
	{
		"id": 207,
		"name": "Дина Богатко"
	},
	{
		"id": 210,
		"name": "Елена Кицило"
	},
	{
		"id": 274,
		"name": "Елизавета Каленкович"
	},
	{
		"id": 208,
		"name": "Ирина Кондрасюк"
	},
	{
		"id": 211,
		"name": "Маргарита Четверик"
	},
	{
		"id": 209,
		"name": "Наталья Друтько"
	}
];

// T - object, V - number (id), S - string (`${region}, ${district}, ${city}`)
const DATA_SET_3 = [
	{
	  	"id": 24565,
	  	"region": "Минская",
	  	"district": "Пуховичский",
	  	"city": "Высокое"
	},
	{
	  	"id": 24567,
	  	"region": "Минская",
	  	"district": "Дзержинский",
	  	"city": "Озерщина"
	},
	{
	  	"id": 24597,
	  	"region": "Минская",
	  	"district": "Смолевичский",
	  	"city": "Садовод"
	},
	{
	  	"id": 18752,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Выголовичи"
	},
	{
	  	"id": 37251,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Вытрески"
	},
	{
	  	"id": 37252,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Гарани"
	},
	{
	  	"id": 25217,
	  	"region": "Минская",
	  	"district": "Минский",
	  	"city": "Сосны-сад"
	},
	{
	  	"id": 18755,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Гатовичи"
	},
	{
	  	"id": 25220,
	  	"region": "Минская",
	  	"district": "Молодечненский",
	  	"city": "Монтажник-87"
	},
	{
	  	"id": 25221,
	  	"region": "Минская",
	  	"district": "Минский",
	  	"city": "Машиностроитель"
	},
	{
	  	"id": 37253,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Глубокий Ручей"
	},
	{
	  	"id": 37254,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Гнездище"
	},
	{
	  	"id": 18759,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Голубеньки"
	},
	{
	  	"id": 18760,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Городище"
	},
	{
	  	"id": 24591,
	  	"region": "Минская",
	  	"district": "Червенский",
	  	"city": "Вересок"
	},
	{
	  	"id": 24586,
	  	"region": "Гродненская",
	  	"district": "Гродненский",
	  	"city": "Урожай-Тарусичи"
	},
	{
	  	"id": 24595,
	  	"region": "Минская",
	  	"district": "Воложинский",
	  	"city": "Пралеска-Плюс"
	},
	{
	  	"id": 37255,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Грибки"
	},
	{
	  	"id": 37256,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Двор Крапивно"
	},
	{
	  	"id": 37257,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Денисово"
	},
	{
	  	"id": 25224,
	  	"region": "Могилёвская",
	  	"district": "Могилёвский",
	  	"city": "Авиатор"
	},
	{
	  	"id": 18766,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Довжани"
	},
	{
	  	"id": 37258,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Дубники"
	},
	{
	  	"id": 37259,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Дубоносы"
	},
	{
	  	"id": 25225,
	  	"region": "Гродненская",
	  	"district": "Гродненский",
	  	"city": "Демидково"
	},
	{
	  	"id": 18769,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Дягили"
	},
	{
	  	"id": 37260,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Дятловщина"
	},
	{
	  	"id": 18771,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Езженцы"
	},
	{
	  	"id": 37261,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Ельница"
	},
	{
	  	"id": 18773,
	  	"region": "Минская",
	  	"district": "Мядельский",
	  	"city": "Железники"
	}
];